report/statistics.json
{
  "POST Create Booking" : {
    "transaction" : "POST Create Booking",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 392.9,
    "medianResTime" : 394.5,
    "minResTime" : 349.0,
    "maxResTime" : 533.0,
    "pct1ResTime" : 411.8,
    "pct2ResTime" : 526.9499999999999,
    "pct3ResTime" : 533.0,
    "throughput" : 2.9511583296443855,
    "receivedKBytesPerSec" : 2.7180052936402537,
    "sentKBytesPerSec" : 1.4401306809797845
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 500.9833333333333,
    "medianResTime" : 408.0,
    "minResTime" : 343.0,
    "maxResTime" : 2192.0,
    "pct1ResTime" : 548.0,
    "pct2ResTime" : 1491.6999999999998,
    "pct3ResTime" : 2118.2899999999972,
    "throughput" : 11.390602752728999,
    "receivedKBytesPerSec" : 9.656613372093023,
    "sentKBytesPerSec" : 3.8850223955861414
  },
  "POST Auth Token" : {
    "transaction" : "POST Auth Token",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1015.95,
    "medianResTime" : 973.0,
    "minResTime" : 351.0,
    "maxResTime" : 2192.0,
    "pct1ResTime" : 1828.9000000000003,
    "pct2ResTime" : 2174.45,
    "pct3ResTime" : 2192.0,
    "throughput" : 2.3199164830066117,
    "receivedKBytesPerSec" : 1.7417497970073077,
    "sentKBytesPerSec" : 0.6943890644936782
  },
  "GET Booking Detail" : {
    "transaction" : "GET Booking Detail",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 397.3,
    "medianResTime" : 408.0,
    "minResTime" : 347.0,
    "maxResTime" : 533.0,
    "pct1ResTime" : 411.8,
    "pct2ResTime" : 526.9499999999999,
    "pct3ResTime" : 533.0,
    "throughput" : 2.9355643622486425,
    "receivedKBytesPerSec" : 2.6210805628944667,
    "sentKBytesPerSec" : 0.6650888008219581
  },
  "PUT Update Booking" : {
    "transaction" : "PUT Update Booking",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 389.7,
    "medianResTime" : 402.5,
    "minResTime" : 343.0,
    "maxResTime" : 463.0,
    "pct1ResTime" : 411.8,
    "pct2ResTime" : 460.44999999999993,
    "pct3ResTime" : 463.0,
    "throughput" : 2.937720329024677,
    "receivedKBytesPerSec" : 2.6248703271886016,
    "sentKBytesPerSec" : 1.4440444605611047
  },
  "PATCH Partial Update Booking" : {
    "transaction" : "PATCH Partial Update Booking",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 410.25000000000006,
    "medianResTime" : 408.5,
    "minResTime" : 344.0,
    "maxResTime" : 548.0,
    "pct1ResTime" : 540.0000000000002,
    "pct2ResTime" : 548.0,
    "pct3ResTime" : 548.0,
    "throughput" : 2.9308323563892147,
    "receivedKBytesPerSec" : 2.632454159950176,
    "sentKBytesPerSec" : 0.8586422919109027
  },
  "DELETE Booking" : {
    "transaction" : "DELETE Booking",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 399.80000000000007,
    "medianResTime" : 406.5,
    "minResTime" : 354.0,
    "maxResTime" : 548.0,
    "pct1ResTime" : 412.0,
    "pct2ResTime" : 541.1999999999999,
    "pct3ResTime" : 548.0,
    "throughput" : 2.9308323563892147,
    "receivedKBytesPerSec" : 2.140309019636577,
    "sentKBytesPerSec" : 0.726983807151231
  }
}